---
kind: property
id: P:Autodesk.Revit.DB.ColorFillScheme.AreaSchemeId
source: html/e24d76dd-38fb-c951-7ae4-d10101b4981b.htm
---
# Autodesk.Revit.DB.ColorFillScheme.AreaSchemeId Property

Represents the id of AreaScheme of area plan views that this scheme could be applied to.

## Syntax (C#)
```csharp
public ElementId AreaSchemeId { get; }
```

## Remarks
Only meaningful if the CategoryId is OST_Areas.